
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>程序员健康最佳作息表 · 《JAVA 向前冲》</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Mr.yang">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-okaidia.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-accordion/accordion.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
        

    

    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    
        <link rel="shortcut icon" href='images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='images/favicon.ico' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='images/apple-touch-icon.png'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="images/apple-touch-icon.png">
        
        <link rel="apple-touch-icon" sizes="180x180" href="images/apple-touch-icon.png">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="程序员健康最佳作息表.html">
            
                <a href="程序员健康最佳作息表.html">
            
                    
                    程序员健康最佳作息表
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >程序员健康最佳作息表</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><ul><li><span class="title-icon "></span><a href="#&#x7A0B;&#x5E8F;&#x5458;&#x5065;&#x5EB7;&#x6700;&#x4F73;&#x4F5C;&#x606F;&#x8868;"><b>1.1. </b>&#x7A0B;&#x5E8F;&#x5458;&#x5065;&#x5EB7;&#x6700;&#x4F73;&#x4F5C;&#x606F;&#x8868;</a></li><li><span class="title-icon "></span><a href="#&#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;"><b>1.2. </b>&#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;</a></li></ul></ul></div><a href="#" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h2 id="&#x7A0B;&#x5E8F;&#x5458;&#x5065;&#x5EB7;&#x6700;&#x4F73;&#x4F5C;&#x606F;&#x8868;"><a name="&#x7A0B;&#x5E8F;&#x5458;&#x5065;&#x5EB7;&#x6700;&#x4F73;&#x4F5C;&#x606F;&#x8868;" class="anchor-navigation-ex-anchor" href="#&#x7A0B;&#x5E8F;&#x5458;&#x5065;&#x5EB7;&#x6700;&#x4F73;&#x4F5C;&#x606F;&#x8868;"><i class="fa fa-link" aria-hidden="true"></i></a>1.1. &#x7A0B;&#x5E8F;&#x5458;&#x5065;&#x5EB7;&#x6700;&#x4F73;&#x4F5C;&#x606F;&#x8868;</h2>
<p>&#x8BF4;&#x5230;&#x5065;&#x5EB7;&#x4F5C;&#x606F;&#xFF0C;&#x8FD8;&#x771F;&#x662F;&#x8981;&#x597D;&#x597D;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x90FD;&#x8BF4;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x4E00;&#x884C;&#xFF0C;&#x731D;&#x6B7B;&#x6982;&#x7387;&#x6781;&#x9AD8;&#xFF0C;&#x7A76;&#x5176;&#x539F;&#x56E0;&#x8FD8;&#x662F;&#x5F88;&#x96BE;&#x6709;&#x5F88;&#x597D;&#x7684;&#x4F5C;&#x606F;&#x89C4;&#x5F8B;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5C31;&#x5E26;&#x6765;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x201C;<strong>&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5065;&#x5EB7;&#x7684;&#x4F5C;&#x606F;&#x65F6;&#x95F4;&#x8868;</strong>&#x201D;&#xFF0C;&#x968F;&#x65F6;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#x5427;&#xFF0C;&#x6BD5;&#x7ADF;&#x8EAB;&#x4F53;&#x53EF;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x54E6;&#x3002;</p>
<p>  <img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>7:30</strong></p>
<p>[<strong>&#x8D77;&#x5E8A;</strong>&#xFF1A;&#x82F1;&#x56FD;&#x5A01;&#x65AF;&#x654F;&#x65AF;&#x7279;&#x5927;&#x5B66;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x53D1;&#x73B0;&#xFF0C;&#x90A3;&#x4E9B;&#x5728;&#x65E9;&#x4E0A;5:22-7:21&#x5206;&#x8D77;&#x5E8A;&#x7684;&#x4EBA;&#xFF0C;&#x5176;&#x8840;&#x6DB2;&#x4E2D;&#x6709;&#x4E00;&#x79CD;&#x80FD;&#x5F15;&#x8D77;&#x5FC3;&#x810F;&#x75C5;&#x7684;&#x7269;&#x8D28;&#x542B;&#x91CF;&#x8F83;&#x9AD8;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;7:21&#x4E4B;&#x540E;&#x8D77;&#x5E8A;&#x5BF9;&#x8EAB;&#x4F53;&#x5065;&#x5EB7;&#x66F4;&#x52A0;&#x6709;&#x76CA;&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>7:30-8:00</strong></p>
<p>[<strong>&#x5728;&#x65E9;&#x996D;&#x4E4B;&#x524D;&#x5237;&#x7259;</strong>&#xFF1A;&#x201C;&#x5728;&#x65E9;&#x996D;&#x4E4B;&#x524D;&#x5237;&#x7259;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x7259;&#x9F7F;&#x7684;&#x8150;&#x8680;&#xFF0C;&#x56E0;&#x4E3A;&#x5237;&#x7259;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7259;&#x9F7F;&#x5916;&#x9762;&#x6D82;&#x4E0A;&#x4E00;&#x5C42;&#x542B;&#x6C1F;&#x7684;&#x4FDD;&#x62A4;&#x5C42;&#x3002;&#x8981;&#x4E48;&#xFF0C;&#x5C31;&#x7B49;&#x65E9;&#x996D;&#x4E4B;&#x540E;&#x534A;&#x5C0F;&#x65F6;&#x518D;&#x5237;&#x7259;&#x3002;&#x201D;&#x82F1;&#x56FD;&#x7259;&#x9F7F;&#x534F;&#x4F1A;&#x5065;&#x5EB7;&#x548C;&#x5B89;&#x5168;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x6208;&#x767B;&#xB7;&#x6C83;&#x7279;&#x91D1;&#x65AF;&#x8BF4;&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>8:00-8:30</strong></p>
<p>[<strong>&#x5403;&#x65E9;&#x996D;</strong>&#xFF1A;&#x201C;&#x65E9;&#x996D;&#x5FC5;&#x987B;&#x5403;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x7EF4;&#x6301;&#x8840;&#x7CD6;&#x6C34;&#x5E73;&#x7684;&#x7A33;&#x5B9A;&#x3002;&#x201D;&#x4F26;&#x6566;&#x5927;&#x5B66;&#x56FD;&#x738B;&#x5B66;&#x9662;&#x8425;&#x517B;&#x5E08;&#x51EF;&#x6587;&#xB7;&#x5A01;&#x5C14;&#x4F26;&#x8BF4;&#x3002;&#x65E9;&#x996D;&#x53EF;&#x4EE5;&#x5403;&#x71D5;&#x9EA6;&#x7CA5;&#x7B49;&#xFF0C;&#x8FD9;&#x7C7B;&#x98DF;&#x7269;&#x5177;&#x6709;&#x8F83;&#x4F4E;&#x7684;&#x8840;&#x7CD6;&#x6307;&#x6570;&#x3002;]</p>
<p><strong>:alarm_clock:8:30-9:00</strong></p>
<p>[<strong>&#x907F;&#x514D;&#x8FD0;&#x52A8;</strong>&#xFF1A;&#x6765;&#x81EA;&#x5E03;&#x9C81;&#x5948;&#x5C14;&#x5927;&#x5B66;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x65E9;&#x6668;&#x8FDB;&#x884C;&#x953B;&#x70BC;&#x7684;&#x8FD0;&#x52A8;&#x5458;&#x66F4;&#x5BB9;&#x6613;&#x611F;&#x67D3;&#x75BE;&#x75C5;&#xFF0C;&#x56E0;&#x4E3A;&#x514D;&#x75AB;&#x7CFB;&#x7EDF;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x7684;&#x529F;&#x80FD;&#x6700;&#x5F31;&#x3002;]</p>
<p>[<strong>&#x6B65;&#x884C;&#x4E0A;&#x73ED;</strong>&#xFF1A;&#x9A6C;&#x8428;&#x8BF8;&#x585E;&#x5DDE;&#x5927;&#x5B66;&#x533B;&#x5B66;&#x9662;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x53D1;&#x73B0;&#xFF0C;&#x6BCF;&#x5929;&#x8D70;&#x8DEF;&#x7684;&#x4EBA;&#xFF0C;&#x6BD4;&#x90A3;&#x4E9B;&#x4E45;&#x5750;&#x4E0D;&#x8FD0;&#x52A8;&#x7684;&#x4EBA;&#x60A3;&#x611F;&#x5192;&#x75C5;&#x7684;&#x6982;&#x7387;&#x4F4E;25%&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>9:30</strong></p>
<p>[<strong>&#x5F00;&#x59CB;&#x4E00;&#x5929;&#x4E2D;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x5DE5;&#x4F5C;</strong>&#xFF1A;&#x7EBD;&#x7EA6;&#x7761;&#x7720;&#x4E2D;&#x5FC3;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x53D1;&#x73B0;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x5728;&#x6BCF;&#x5929;&#x9192;&#x6765;&#x7684;&#x4E00;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x5934;&#x8111;&#x6700;&#x6E05;&#x9192;&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>10:30</strong></p>
<p>[<strong>&#x8BA9;&#x773C;&#x775B;&#x79BB;&#x5F00;&#x5C4F;&#x5E55;&#x4F11;&#x606F;&#x4E00;&#x4E0B;</strong>&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7535;&#x8111;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x5DE5;&#x4F5C;&#x4E00;&#x5C0F;&#x65F6;&#xFF0C;&#x5C31;&#x8BA9;&#x773C;&#x775B;&#x4F11;&#x606F;3&#x5206;&#x949F;&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>11:00</strong></p>
<p>[<strong>&#x5403;&#x70B9;&#x6C34;&#x679C;</strong>&#xFF1A;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x8EAB;&#x4F53;&#x8840;&#x7CD6;&#x4E0B;&#x964D;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x5403;&#x4E00;&#x4E2A;&#x6A59;&#x5B50;&#x6216;&#x4E00;&#x4E9B;&#x7EA2;&#x8272;&#x6C34;&#x679C;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x80FD;&#x540C;&#x65F6;&#x8865;&#x5145;&#x4F53;&#x5185;&#x7684;&#x94C1;&#x542B;&#x91CF;&#x548C;&#x7EF4;&#x751F;&#x7D20;C&#x542B;&#x91CF;&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>13:00</strong></p>
<p>[<strong>&#x5728;&#x9762;&#x5305;&#x4E0A;&#x52A0;&#x4E00;&#x4E9B;&#x8C46;&#x7C7B;&#x852C;&#x83DC;</strong>&#xFF1A;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x987F;&#x53EF;&#x53E3;&#x7684;&#x5348;&#x9910;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x7F13;&#x6162;&#x5730;&#x91CA;&#x653E;&#x80FD;&#x91CF;&#x3002;&#x201C;&#x70D8;&#x70E4;&#x7684;&#x8C46;&#x7C7B;&#x98DF;&#x54C1;&#x5BCC;&#x542B;&#x7EA4;&#x7EF4;&#x7D20;&#xFF0C;&#x756A;&#x8304;&#x9171;&#x53EF;&#x4EE5;&#x5F53;&#x4F5C;&#x662F;&#x852C;&#x83DC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x201D;&#x7EF4;&#x4F26;&#x535A;&#x58EB;&#x8BF4;&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>14:30-15:30</strong></p>
<p>[<strong>&#x5348;&#x4F11;&#x4E00;&#x5C0F;&#x4F1A;&#x513F;</strong>&#xFF1A;&#x96C5;&#x5178;&#x7684;&#x4E00;&#x6240;&#x5927;&#x5B66;&#x7814;&#x7A76;&#x53D1;&#x73B0;&#xFF0C;&#x90A3;&#x4E9B;&#x6BCF;&#x5929;&#x4E2D;&#x5348;&#x5348;&#x4F11;30&#x5206;&#x949F;&#x6216;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x6BCF;&#x5468;&#x81F3;&#x5C11;&#x5348;&#x4F11;3&#x6B21;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x5FC3;&#x810F;&#x75C5;&#x6B7B;&#x4EA1;&#x7684;&#x6982;&#x7387;&#x4F1A;&#x4E0B;&#x964D;37%&#x3002;]</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>16:00</strong></p>
<p><strong>&#x559D;&#x676F;&#x9178;&#x5976;</strong>&#xFF1A;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x7A33;&#x5B9A;&#x8840;&#x7CD6;&#x6C34;&#x5E73;&#x3002;&#x5728;&#x6BCF;&#x5929;&#x4E09;&#x9910;&#x4E4B;&#x95F4;&#x559D;&#x4E9B;&#x9178;&#x725B;&#x5976;&#xFF0C;&#x6709;&#x5229;&#x4E8E;&#x5FC3;&#x810F;&#x5065;&#x5EB7;&#x3002;</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>17:00-19:00</strong></p>
<p><strong>&#x953B;&#x70BC;&#x8EAB;&#x4F53;</strong>&#xFF1A;&#x6839;&#x636E;&#x4F53;&#x5185;&#x7684;&#x751F;&#x7269;&#x949F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x662F;&#x8FD0;&#x52A8;&#x7684;&#x6700;&#x4F73;&#x65F6;&#x95F4;&#xFF0C;&#x820D;&#x83F2;&#x5C14;&#x5FB7;&#x5927;&#x5B66;&#x8FD0;&#x52A8;&#x5B66;&#x533B;&#x751F;&#x745E;&#x6C83;&#xB7;&#x5C3C;&#x514B;&#x8BF4;&#x3002;</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>19:30</strong></p>
<p><strong>&#x665A;&#x9910;&#x5C11;&#x5403;&#x70B9;</strong>&#xFF1A;&#x665A;&#x996D;&#x5403;&#x592A;&#x591A;&#xFF0C;&#x4F1A;&#x5F15;&#x8D77;&#x8840;&#x7CD6;&#x5347;&#x9AD8;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x6D88;&#x5316;&#x7CFB;&#x7EDF;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x5F71;&#x54CD;&#x7761;&#x7720;&#x3002;&#x665A;&#x996D;&#x5E94;&#x8BE5;&#x591A;&#x5403;&#x852C;&#x83DC;&#xFF0C;&#x5C11;&#x5403;&#x5BCC;&#x542B;&#x5361;&#x8DEF;&#x91CC;&#x548C;&#x86CB;&#x767D;&#x8D28;&#x7684;&#x98DF;&#x7269;&#x3002;&#x5403;&#x996D;&#x65F6;&#x8981;&#x7EC6;&#x56BC;&#x6162;&#x54BD;&#x3002;</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>21:45</strong></p>
<p><strong>&#x770B;&#x4F1A;&#x7535;&#x89C6;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x770B;&#x4F1A;&#x513F;&#x7535;&#x89C6;&#x653E;&#x677E;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x7761;&#x7720;&#xFF0C;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x770B;&#x7535;&#x89C6;&#xFF0C;&#x8FD9;&#x4F1A;&#x5F71;&#x54CD;&#x7761;&#x7720;&#x8D28;&#x91CF;&#x3002;</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>23:00</strong></p>
<p><strong>&#x6D17;&#x4E2A;&#x70ED;&#x6C34;&#x6FA1;</strong>&#xFF1A;&#x201C;&#x4F53;&#x6E29;&#x7684;&#x9002;&#x5F53;&#x964D;&#x4F4E;&#x6709;&#x52A9;&#x4E8E;&#x653E;&#x677E;&#x548C;&#x7761;&#x7720;&#x3002;&#x201D;&#x62C9;&#x592B;&#x5821;&#x5927;&#x5B66;&#x7761;&#x7720;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x5409;&#x59C6;&#xB7;&#x970D;&#x6069;&#x6559;&#x6388;&#x8BF4;&#x3002;</p>
<p><img align="absmiddle" alt=":alarm_clock:" class="emoji" src="gitbook/gitbook-plugin-advanced-emoji/emojis/alarm_clock.png" title=":alarm_clock:"><strong>23:30</strong></p>
<p><strong>&#x4E0A;&#x5E8A;&#x7761;&#x89C9;</strong>&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x65E9;&#x4E0A;7&#x70B9;30&#x8D77;&#x5E8A;&#xFF0C;&#x73B0;&#x5728;&#x5165;&#x7761;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4F60;&#x4EAB;&#x53D7;8&#x5C0F;&#x65F6;&#x5145;&#x8DB3;&#x7684;&#x7761;&#x7720;&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;"><a name="&#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;" class="anchor-navigation-ex-anchor" href="#&#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;"><i class="fa fa-link" aria-hidden="true"></i></a>1.2. &#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;</h2>
<p>&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x4EFB;&#x4F55;&#x8BD5;&#x56FE;&#x66F4;&#x6539;&#x751F;&#x7269;&#x949F;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x90FD;&#x5C06;&#x7ED9;&#x8EAB;&#x4F53;&#x7559;&#x4E0B;&#x83AB;&#x540D;&#x5176;&#x5999;&#x7684;&#x75BE;&#x75C5;&#xFF0C;&#x7B49;&#x5230;20&#x3001;30&#x5E74;&#x4E4B;&#x540E;&#x518D;&#x540E;&#x6094;&#xFF0C;&#x5DF2;&#x7ECF;&#x6765;&#x4E0D;&#x53CA;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x518D;&#x8865;&#x5145;&#x4E00;&#x4E9B;&#x548C;&#x65F6;&#x95F4;&#x3001;&#x5065;&#x5EB7;&#x6709;&#x5173;&#x7684;&#x5C0F;&#x5E38;&#x8BC6;&#xFF0C;&#x7EE7;&#x7EED;&#x4F9B;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#xFF1A;</p>
<ol>
<li>&#x665A;&#x4E0A;9-11&#x70B9;&#x4E3A;&#x514D;&#x75AB;&#x7CFB;&#x7EDF;&#xFF08;&#x6DCB;&#x5DF4;&#xFF09;&#x6392;&#x6BD2;&#x65F6;&#x95F4;&#xFF0C;&#x6B64;&#x6BB5;&#x65F6;&#x95F4;&#x5E94;&#x5B89;&#x9759;&#x6216;&#x542C;&#x97F3;&#x4E50;&#x3002;</li>
<li>&#x665A;&#x95F4;11-&#x51CC;&#x6668;1&#x70B9;&#xFF0C;&#x809D;&#x7684;&#x6392;&#x6BD2;&#xFF0C;&#x9700;&#x5728;&#x719F;&#x7761;&#x4E2D;&#x8FDB;&#x884C;&#x3002;</li>
<li>&#x51CC;&#x6668;1-3&#x70B9;&#xFF0C;&#x80C6;&#x7684;&#x6392;&#x6BD2;&#xFF0C;&#x4EA6;&#x540C;&#x3002;</li>
<li>&#x51CC;&#x6668;3-5&#x70B9;&#xFF0C;&#x80BA;&#x7684;&#x6392;&#x6BD2;&#x3002;&#x6B64;&#x5373;&#x4E3A;&#x4F55;&#x54B3;&#x55FD;&#x7684;&#x4EBA;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x54B3;&#x5F97;&#x6700;&#x5267;&#x70C8;&#xFF0C;&#x56E0;&#x6392;&#x6BD2;&#x52A8;&#x4F5C;&#x5DF2;&#x8D70;&#x5230;&#x80BA;&#xFF1B;&#x4E0D;&#x5E94;&#x7528;&#x6B62;&#x54B3;&#x836F;&#xFF0C;&#x4EE5;&#x514D;&#x6291;&#x5236;&#x5E9F;&#x79EF;&#x7269;&#x7684;&#x6392;&#x9664;&#x3002;</li>
<li>&#x51CC;&#x6668;5-7&#x70B9;&#xFF0C;&#x5927;&#x80A0;&#x7684;&#x6392;&#x6BD2;&#xFF0C;&#x5E94;&#x4E0A;&#x5395;&#x6240;&#x6392;&#x4FBF;&#x3002;</li>
<li>&#x51CC;&#x6668;7-9&#x70B9;&#xFF0C;&#x5C0F;&#x80A0;&#x5927;&#x91CF;&#x5438;&#x6536;&#x8425;&#x517B;&#x7684;&#x65F6;&#x6BB5;&#xFF0C;&#x5E94;&#x5403;&#x65E9;&#x9910;&#x3002;&#x7597;&#x75C5;&#x8005;&#x6700;&#x597D;&#x65E9;&#x5403;&#xFF0C;&#x5728;6&#x70B9;&#x534A;&#x524D;&#xFF0C;&#x517B;&#x751F;&#x8005;&#x5728;7&#x70B9;&#x534A;&#x524D;&#xFF0C;&#x4E0D;&#x5403;&#x65E9;&#x9910;&#x8005;&#x5E94;&#x6539;&#x53D8;&#x4E60;&#x60EF;&#xFF0C;&#x5373;&#x4F7F;&#x62D6;&#x5230;9&#x3001;10&#x70B9;&#x5403;&#x90FD;&#x6BD4;&#x4E0D;&#x5403;&#x597D;&#x3002;</li>
<li>&#x534A;&#x591C;&#x81F3;&#x51CC;&#x6668;4&#x70B9;&#x4E3A;&#x810A;&#x690E;&#x9020;&#x8840;&#x65F6;&#x6BB5;&#xFF0C;&#x5FC5;&#x987B;&#x719F;&#x7761;&#xFF0C;&#x4E0D;&#x5B9C;&#x71AC;&#x591C;&#x3002;</li>
</ol>
<p><footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#xA9; 2023 <a href="https://github.com/avenuetojane" target="_blank">Mr.yang</a> All Rights Reserved ,powered by Gitbook </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <i>updated</i> 2023-02-19 21:52:20 </span> </footer><hr><div id="vcomments"></div><script src="//unpkg.com/valine/dist/Valine.min.js"></script><script>new Valine({el: "#vcomments",appId: 'dku5p3C2DrEuFcKii6Ug3khi-gzGzoHsz',appKey: 'UOPtkfevniTbyZfjspx5gc3B',placeholder: '请写下你的评论吧...',avatar: '',meta: undefined,pageSize: 10,lang: 'zh-CN',recordIP: false})</script></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"程序员健康最佳作息表","level":"1.2","depth":1,"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters","-lunr","-search","-sharing","search-pro","sharing-plus","-highlight","fontsettings","-sharing ","-livereload","donate","-back-to-top-button","copy-code-button","-pageview-count","hide-element","page-footer-ex","anchor-navigation-ex","expandable-chapters-small","prism","splitter","accordion","favicon","-page-toc-button","github","insert-logo","-page-treeview","-theme-door","advanced-emoji","valine","baidu-tongji-with-multiple-channel","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-okaidia.css"],"lang":{"flow":"typescript"}},"github":{"url":"https://github.com/avenuetojane"},"baidu-tongji-with-multiple-channel":{"multipleChannelConfig":{},"url":"https://hm.baidu.com/hm.js","token":"a30a822e15caa378ba5bca6adc67c927"},"page-footer-ex":{"copyright":"© 2023 [Mr.yang](https://github.com/avenuetojane) All Rights Reserved ,powered by Gitbook","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<i>updated</i>"},"splitter":{},"search-pro":{},"accordion":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"donate":{"alipay":"./images/zhifubao.jpg","alipayText":"支付宝捐赠","button":"捐赠","title":"","wechat":"./images/weixin.jpg","wechatText":"微信捐赠"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"family":"sans","size":2,"theme":"white"},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":true},"favicon":{"shortcut":"./images/favicon.ico","bookmark":"./images/favicon.ico","appleTouch":"./images/apple-touch-icon.png","appleTouchMore":{"120x120":"./images/apple-touch-icon.png","180x180":"./images/apple-touch-icon.png"}},"expandable-chapters-small":{},"copy-code-button":{},"advanced-emoji":{"embedEmojis":false},"sharing":{"qq":true,"all":[],"douban":false,"facebook":false,"weibo":true,"twitter":true,"pocket":false,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background:none;max-height: 100px; min-height: 10px","url":"images/book.jpg"},"expandable-chapters":{},"valine":{"avatar":"","lang":"zh-CN","pageSize":10,"placeholder":"请写下你的评论吧...","recordIP":false,"appId":"dku5p3C2DrEuFcKii6Ug3khi-gzGzoHsz","appKey":"UOPtkfevniTbyZfjspx5gc3B"}},"theme":"default","author":"Mr.yang","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"《JAVA 向前冲》","language":"zh-hans","gitbook":"3.2.3","description":"一本集作者十年开发经验的 JAVA 电子书"},"file":{"path":"程序员健康最佳作息表.md","mtime":"2023-02-19T13:52:20.234Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-02-19T13:53:35.622Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-accordion/accordionSelector.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-baidu-tongji-with-multiple-channel/plugin.js"></script>
        
    

    </body>
</html>

